In [1]:
import pandas as pd
import numpy as np
import os
import seaborn as sns
import matplotlib.pyplot as plt
from pydataset import data

### #1 In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

- print the first 3 rows
- print the number of rows and columns (shape)
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [2]:
df_iris=data('iris')

In [77]:
#can also use seaborn to load
df_iris_seaborn=sns.load_dataset('iris')

In [3]:
#print the first 3 rows
df_iris.head(3)

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
1           5.1          3.5           1.4          0.2  setosa
2           4.9          3.0           1.4          0.2  setosa
3           4.7          3.2           1.3          0.2  setosa

In [4]:
#print the number of rows and columns (shape)
df_iris.shape

(150, 5)

In [5]:
#print the column names
df_iris.columns

Index(['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width',
       'Species'],
      dtype='object')

In [78]:
#turn it into a list
df_iris.columns.to_list()

['Sepal.Length', 'Sepal.Width', 'Petal.Length', 'Petal.Width', 'Species']

In [6]:
#print the data type of each column
#can also use .dyptes
df_iris.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 1 to 150
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Sepal.Length  150 non-null    float64
 1   Sepal.Width   150 non-null    float64
 2   Petal.Length  150 non-null    float64
 3   Petal.Width   150 non-null    float64
 4   Species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 7.0+ KB

In [7]:
#print the summary statistics for each of the numeric variables. 
df_iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

#Would you recommend rescaling the data based on these statistics?
- not in this case. it is all in mm and range is not large

In [82]:
#can transcribe to make easier to read
df_iris.describe().T

              count      mean       std  min  25%   50%  75%  max
Sepal.Length  150.0  5.843333  0.828066  4.3  5.1  5.80  6.4  7.9
Sepal.Width   150.0  3.057333  0.435866  2.0  2.8  3.00  3.3  4.4
Petal.Length  150.0  3.758000  1.765298  1.0  1.6  4.35  5.1  6.9
Petal.Width   150.0  1.199333  0.762238  0.1  0.3  1.30  1.8  2.5

_______

### #2 Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

- assign the first 100 rows to a new dataframe, df_excel_sample
- print the number of rows of your original dataframe
- print the first 5 column names
- print the column names that have a data type of object
- compute the range for each of the numeric variables.

In [8]:
df_excel = pd.read_excel('Excel_Exercises.xlsx', sheet_name='Table1_CustDetails')

In [9]:
df_excel.head()

,customer_id,gender,is_senior_citizen,partner,dependents,phone_service,internet_service,contract_type,payment_type,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,1,1,1,Mailed check,65.6,593.30,No
1,0003-MKNFE,Male,0,No,No,2,1,0,Mailed check,59.9,542.40,No
2,0004-TLHLJ,Male,0,No,No,1,2,0,Electronic check,73.9,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,1,2,0,Electronic check,98.0,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,1,2,0,Mailed check,83.9,267.40,Yes

In [10]:
# assign the first 100 rows to a new dataframe, df_excel_sample
df_excel_sample = df_excel.head(100)

In [84]:
# print the number of rows of your original dataframe
df_excel.shape[0]

7049

In [12]:
# print the first 5 column names
df_excel.columns[:5]

Index(['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents'], dtype='object')

In [13]:
# print the column names that have a data type of object
df_excel.dtypes

customer_id           object
gender                object
is_senior_citizen      int64
partner               object
dependents            object
phone_service          int64
internet_service       int64
contract_type          int64
payment_type          object
monthly_charges      float64
total_charges        float64
churn                 object
dtype: object

In [86]:
list(df_excel.select_dtypes(['object']).columns)

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

In [15]:
# compute the range for each of the numeric variables.
#step 1 create new variable with ONLY numeric values
excel_range = df_excel.select_dtypes(include=[np.number])
list(excel_range)

['is_senior_citizen',
 'phone_service',
 'internet_service',
 'contract_type',
 'monthly_charges',
 'total_charges']

In [90]:
#can also get range of specific columns
df_excel[['monthly_charges', 'total_charges']].describe()

       monthly_charges  total_charges
count      7049.000000    7038.000000
mean         64.747014    2283.043883
std          30.099460    2266.521984
min          18.250000      18.800000
25%          35.450000     401.587500
50%          70.350000    1397.100000
75%          89.850000    3793.775000
max         118.750000    8684.800000

In [16]:
#step 2 get max and min to get range
numeric_ranges = excel_range.max()- excel_range.min()
numeric_ranges

is_senior_citizen       1.0
phone_service           2.0
internet_service        2.0
contract_type           2.0
monthly_charges       100.5
total_charges        8666.0
dtype: float64

_______

### #3 Read the data from this google sheet into a dataframe, df_google

- print the first 3 rows
- print the number of rows and columns
- print the column names
- print the data type of each column
- print the summary statistics for each of the numeric variables
- print the unique values for each of your categorical variables

In [32]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'
csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')
df_google = pd.read_csv(csv_export_url)

In [34]:
#print the first 3 rows
df_google.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [46]:
#print the number of rows and columns
df_google.shape

(891, 12)

In [47]:
#print the column names
df_google.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [91]:
#put it into a list- easier to read
df_google.columns.to_list()

['PassengerId',
 'Survived',
 'Pclass',
 'Name',
 'Sex',
 'Age',
 'SibSp',
 'Parch',
 'Ticket',
 'Fare',
 'Cabin',
 'Embarked']

In [50]:
#print the data type of each column
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [92]:
# print the summary statistics for each of the numeric variables
df_google.describe().T

,count,mean,std,min,25%,50%,75%,max
PassengerId,891.0,446.000000,257.353842,1.00,223.5000,446.0000,668.5,891.0000
Survived,891.0,0.383838,0.486592,0.00,0.0000,0.0000,1.0,1.0000
Pclass,891.0,2.308642,0.836071,1.00,2.0000,3.0000,3.0,3.0000
Age,714.0,29.699118,14.526497,0.42,20.1250,28.0000,38.0,80.0000
SibSp,891.0,0.523008,1.102743,0.00,0.0000,0.0000,1.0,8.0000
Parch,891.0,0.381594,0.806057,0.00,0.0000,0.0000,0.0,6.0000
Fare,891.0,32.204208,49.693429,0.00,7.9104,14.4542,31.0,512.3292

In [54]:
# print the unique values for each of your categorical variables
list(df_excel.select_dtypes(['object']).columns)

['customer_id', 'gender', 'partner', 'dependents', 'payment_type', 'churn']

In [55]:
df_google.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [68]:
df_google.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [94]:
#df_google['Name'].unique()

In [95]:
#This will give you the breakdown of each column
#dropna = False- will show if you have nulls
df_google.Pclass.value_counts(dropna=False)

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [96]:
df_google.Embarked.value_counts(dropna=False)

S      644
C      168
Q       77
NaN      2
Name: Embarked, dtype: int64

In [97]:
df_google.Cabin.value_counts(dropna=False)

NaN                687
B96 B98              4
C23 C25 C27          4
G6                   4
C22 C26              3
E101                 3
D                    3
F2                   3
F33                  3
C124                 2
E33                  2
E8                   2
B49                  2
F4                   2
C92                  2
E24                  2
F G73                2
C125                 2
B22                  2
B58 B60              2
E121                 2
E67                  2
D26                  2
C83                  2
C52                  2
C68                  2
C93                  2
C78                  2
D36                  2
C2                   2
C123                 2
B18                  2
B51 B53 B55          2
B57 B59 B63 B66      2
E44                  2
D20                  2
C65                  2
D33                  2
E25                  2
B77                  2
C126                 2
B20                  2
D17                  2
D35                  2
B5                   2
B28                  2
B35                  2
A36                  1
C86                  1
B19                  1
B101                 1
A23                  1
E58                  1
C82                  1
D19                  1
C30                  1
A26                  1
C101                 1
C110                 1
A14                  1
T                    1
C45                  1
B94                  1
C128                 1
E63                  1
E38                  1
A16                  1
B39                  1
B69                  1
A5                   1
E12                  1
D10 D12              1
D46                  1
E77                  1
B50                  1
B78                  1
C103                 1
C70                  1
D30                  1
C32                  1
E31                  1
F E69                1
B38                  1
E34                  1
B42                  1
C111                 1
E46                  1
D11                  1
C7                   1
C49                  1
A20                  1
B102                 1
A7                   1
B37                  1
B71                  1
E68                  1
D48                  1
A6                   1
C148                 1
B86                  1
D45                  1
C62 C64              1
A32                  1
B73                  1
C54                  1
B79                  1
B30                  1
B4                   1
D21                  1
A24                  1
C90                  1
A34                  1
C104                 1
B3                   1
D49                  1
D6                   1
B82 B84              1
E36                  1
C118                 1
D9                   1
C99                  1
C50                  1
E40                  1
C47                  1
D7                   1
B41                  1
E17                  1
A10                  1
D28                  1
E49                  1
C106                 1
D37                  1
D50                  1
C87                  1
D56                  1
E10                  1
C91                  1
A31                  1
F38                  1
A19                  1
E50                  1
D47                  1
B80                  1
C85                  1
C46                  1
F G63                1
C95                  1
D15                  1
Name: Cabin, dtype: int64

In [98]:
df_google.Ticket.value_counts(dropna=False)

1601          7
CA. 2343      7
347082        7
CA 2144       6
3101295       6
             ..
5727          1
349248        1
386525        1
C.A. 24580    1
2683          1
Name: Ticket, Length: 681, dtype: int64

In [99]:
df_google.Sex.value_counts(dropna=False)

male      577
female    314
Name: Sex, dtype: int64